"""

应用一：打印星号（正方形）
分析：一行输出5个星号，重复打印5行

应用二：打印星号（三角形）
分析：一行输出星星的个数和行号是相等的。每行：重复打印行号数字个星号，将打印行星号的命令重复执行5次实现打印5次

应用三：九九乘法表

"""
# 举例代码一：
j = 0
while j <= 4:
    i = 0
    while i <= 4:
        print('*',end='')
        # end= 的意思是打印完星号之后不换行，继续同一行输出
        i += 1
    print()
    j += 1

# 举例代码二：
j = 0
while j <= 4:
    i = 0
    while i <= j:
        print('*',end='')
        i += 1
    print()  # 打印之后用print()换行
    j += 1

# 举例代码三：
j = 1
while j <= 9:
    i = 1
    while i <= j:
        print(f'{i} * {j} = {i*j}',end='\t')
        i += 1
    print()
    j += 1


